### Report for transfer-classifier on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 3.74"...
- Installing hashicorp/aws v3.76.1...
- Installed hashicorp/aws v3.76.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (1 to add, 7 to change, 1 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.transfer_classifier_output_bucket_read_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "transfer_classifier_output_bucket_read_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-transfer-data-dev",
            ]
          + sid       = "ListBucket"
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-transfer-data-dev/*",
            ]
          + sid       = "ReadObjects"
        }
    }

  # data.aws_iam_policy_document.transfer_classifier_output_buckets_write_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "transfer_classifier_output_buckets_write_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-notebook-data-dev/*",
              + "arn:aws:s3:::prm-gp2gp-transfer-data-dev/*",
            ]
          + sid       = "WriteObjects"
        }
    }

  # aws_ecs_task_definition.transfer_classifier must be replaced
-/+ resource "aws_ecs_task_definition" "transfer_classifier" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-transfer-classifier:232" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "dev-transfer-classifier" -> (known after apply)
      ~ revision                 = 232 -> (known after apply)
      ~ tags                     = {
            "ApplicationRole"     = "AwsEcsTaskDefinition"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-transfer-classifier"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all                 = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_iam_policy.transfer_classifier_output_bucket_read_access will be updated in-place
  ~ resource "aws_iam_policy" "transfer_classifier_output_bucket_read_access" {
        id          = "arn:aws:iam::343515223843:policy/prm-gp2gp-transfer-data-dev-read"
        name        = "prm-gp2gp-transfer-data-dev-read"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::prm-gp2gp-transfer-data-dev"
                      - Sid      = "ListBucket"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::prm-gp2gp-transfer-data-dev/*"
                      - Sid      = "ReadObjects"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.transfer_classifier_output_buckets_write_access will be updated in-place
  ~ resource "aws_iam_policy" "transfer_classifier_output_buckets_write_access" {
        id          = "arn:aws:iam::343515223843:policy/transfer-classifier-output-buckets-dev-write"
        name        = "transfer-classifier-output-buckets-dev-write"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::prm-gp2gp-transfer-data-dev/*",
                          - "arn:aws:s3:::prm-gp2gp-notebook-data-dev/*",
                        ]
                      - Sid      = "WriteObjects"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket.transfer_classifier will be updated in-place
  ~ resource "aws_s3_bucket" "transfer_classifier" {
        id                          = "prm-gp2gp-transfer-data-dev"
      ~ tags                        = {
            "ApplicationRole"     = "AwsS3Bucket"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-output-transfer-data-for-metrics-calculator-and-data-analysis"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all                    = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ssm_parameter.transfer_classifier_iam_role_arn will be updated in-place
  ~ resource "aws_ssm_parameter" "transfer_classifier_iam_role_arn" {
        id              = "/registrations/dev/data-pipeline/transfer-classifier/iam-role-arn"
        name            = "/registrations/dev/data-pipeline/transfer-classifier/iam-role-arn"
      ~ tags            = {
            "ApplicationRole"     = "AwsSsmParameter"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-transfer-classifier-iam-role"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.transfer_classifier_output_bucket_name will be updated in-place
  ~ resource "aws_ssm_parameter" "transfer_classifier_output_bucket_name" {
        id              = "/registrations/dev/data-pipeline/transfer-classifier/output-bucket-name"
        name            = "/registrations/dev/data-pipeline/transfer-classifier/output-bucket-name"
      ~ tags            = {
            "ApplicationRole"     = "AwsSsmParameter"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-transfer-classifier-output-bucket-name"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.transfer_classifier_output_bucket_read_access_arn will be updated in-place
  ~ resource "aws_ssm_parameter" "transfer_classifier_output_bucket_read_access_arn" {
        id              = "/registrations/dev/data-pipeline/transfer-classifier/output-bucket-read-access-arn"
        name            = "/registrations/dev/data-pipeline/transfer-classifier/output-bucket-read-access-arn"
      ~ tags            = {
            "ApplicationRole"     = "AwsSsmParameter"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-transfer-classifier-output-bucket-read-access-arn"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.transfer_classifier_task_definition_arn will be updated in-place
  ~ resource "aws_ssm_parameter" "transfer_classifier_task_definition_arn" {
        id              = "/registrations/dev/data-pipeline/transfer-classifier/task-definition-arn"
        name            = "/registrations/dev/data-pipeline/transfer-classifier/task-definition-arn"
      ~ tags            = {
            "ApplicationRole"     = "AwsSsmParameter"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-transfer-classifier-task-definition-arn"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
      ~ value           = (sensitive value)
      ~ version         = 231 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 7 to change, 1 to destroy.

```

</details>